ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/GSC_0.1.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="GSC" HW_revision="0.1">
    <register id="GSC_SPC_ATTRIBVIOLS_CONFIG" width="32" offset="0x1000" description="SRAM Secure Access Attribute Violation Configuration Register">
        <bitfield id="SECVIOL" description="Controls the behavior of secure access to non-secure SRAM #br#0: Access is allowed #br#1: Access generates bus-fault and NMI" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_SPC_ATTRIBVIOLP_CONFIG" width="32" offset="0x1004" description="SRAM Privilege Access Attribute Violation Configuration Register">
        <bitfield id="PRIVVIOL" description="Controls the behavior of privilege access to non-privilege SRAM #br#0: Access is allowed #br#1: Access generates bus-fault and NMI" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_ATTRIBVIOLS_CONFIG" width="32" offset="0x1010" description="Peripheral Secure Access Attribute Violation Configuration Register">
        <bitfield id="SECVIOL" description="Controls the behavior of secure access to non-secure peripheral #br#0: Access is allowed #br#1: Access generates bus-fault and NMI" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_ATTRIBVIOLP_CONFIG" width="32" offset="0x1014" description="Peripheral Privilege Access Attribute Violation Configuration Register">
        <bitfield id="PRIVVIOL" description="Controls the behavior of privilege access to non-privilege peripherals #br#0: Access is allowed #br#1: Access generates bus-fault and NMI" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_ATTRIBVIOLS_CONFIG" width="32" offset="0x1020" description="Flash Secure Access Attribute Violation Configuration Register">
        <bitfield id="SECVIOL" description="Controls the behavior of secure access to non-secure Flash #br#0: Access is allowed #br#1: Access generates bus-fault and NMI" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_ATTRIBVIOLP_CONFIG" width="32" offset="0x1024" description="Flash Privilege Access Attribute Violation Configuration Register">
        <bitfield id="PRIVVIOL" description="Controls the behavior of privilege access to non-privilege Flash #br#0: Access is allowed #br#1: Access generates bus-fault and NMI" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_HDPPROT0_CONFIG" width="32" offset="0x1040" description="Flash Hide Protection for Bank0 Configuration Register">
        <bitfield id="HDPEND" description="Sector number where hide protection ends" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="HDPSTART" description="Sector number where hide protection starts" begin="23" end="16" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_HDPPROT1_CONFIG" width="32" offset="0x1044" description="Flash Hide Protection for Bank1 Configuration Register">
        <bitfield id="HDPEND" description="Sector number where hide protection ends" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="HDPSTART" description="Sector number where hide protection starts" begin="23" end="16" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_HDPPROT_CONTROL" width="32" offset="0x104C" description="Flash Hide Protection Control Register">
        <bitfield id="HDPPROT0ACCDIS" description="Enables the FPC_HDPPROT0_CONFIG to take effect. #br#0: HDP region access is enabled #br#1: HDP region access is disabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="HDPPROT1ACCDIS" description="Enables the FPC_HDPPROT1_CONFIG to take effect. #br#0: HDP region access is enabled #br#1: HDP region access is disabled" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_HDPEN_CONTROL" width="32" offset="0x1050" description="Flash Hide Protection Enable Control Register">
        <bitfield id="HDPEN" description="HDP mode enable. This bit is set in the OTP during provisioning.  #br#0: HDP mode is not used #br#1: HDP mode is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_NONMAIN0_HDPPROT_CONTROL" width="32" offset="0x1054" description="Flash NONMAIN Bank0 Hide Protection Control Register">
        <bitfield id="HDPROTACCDIS" description="Enable HDP access to NONMAIN region #br#0: HDP region access is enabled #br#1: HDP region access is disabled" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_NONMAIN1_HDPPROT_CONTROL" width="32" offset="0x1058" description="Flash NONMAIN Bank1 Hide Protection Control Register">
        <bitfield id="HDPROTACCDIS" description="Enable HDP access to NONMAIN region #br#0: HDP region access is enabled #br#1: HDP region access is disabled" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_TRIM0_HDPPROT_CONTROL" width="32" offset="0x105C" description="Flash TRIM Bank0 Hide Protection Control Register">
        <bitfield id="HDPROTACCDIS" description="Enable HDP access to TRIM region #br#0: HDP region access is enabled #br#1: HDP region access is disabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="HDPROTACCDIS1" description="No functionality implemented for this bit" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_TRIM1_HDPPROT_CONTROL" width="32" offset="0x1060" description="Flash TRIM Bank1 Hide Protection Control Register">
        <bitfield id="HDPROTACCDIS" description="Enable HDP access to TRIM region #br#0: HDP region access is enabled #br#1: HDP region access is disabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="HDPROTACCDIS1" description="No functionality implemented for this bit" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_ENGR0_HDPPROT_CONTROL" width="32" offset="0x1064" description="Flash ENGR Bank0 Hide Protection Control Register">
        <bitfield id="HDPROTACCDIS" description="Enable HDP access to ENGR region #br#0: HDP region access is enabled #br#1: HDP region access is disabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="HDPROTACCDIS1" description="No functionality implemented for this bit" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_ENGR1_HDPPROT_CONTROL" width="32" offset="0x1068" description="Flash ENGR Bank1 Hide Protection Control Register">
        <bitfield id="HDPROTACCDIS" description="Enable HDP access to ENGR region #br#0: HDP region access is enabled #br#1: HDP region access is disabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="HDPROTACCDIS1" description="No functionality implemented for this bit" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_HDPPROT_DBANK_CONFIG" width="32" offset="0x1080" description="Data Flash Hide Protection Configuration Register">
        <bitfield id="HDPEND" description="Sector number where hide protection ends" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="HDPSTART" description="Sector number where hide protection starts" begin="19" end="16" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_HDPPROT_DBANK_CONTROL" width="32" offset="0x1084" description="Data Flash Hide Protection Control Register">
        <bitfield id="HDPPROTACCDIS" description="Enables the HDP register to take effect for Databank #br#0: HDP region access is enabled #br#1: HDP region access is disabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_HDPEN_DBANK_CONTROL" width="32" offset="0x1088" description="Data Flash Hide Protection Enable Control Register">
        <bitfield id="HDPEN" description="HDP mode enable. This bit is set in the OTP during provisioning and copied from the OTP memory during boot by BOOTROM.  #br#0: HDP mode is not used #br#1: HDP mode is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_NONMAIN_HDPPROT_DBANK_CONTROL" width="32" offset="0x108C" description="Data Flash NONMAIN Hide Protection Control Register">
        <bitfield id="HDPROTACCDIS" description="Enable HDP access to NONMAIN region #br#0: HDP region access is enabled #br#1: HDP region access is disabled" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
