ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/GSC_0.1.xml
    <register id="GSC_FPC_TRIM_HDPPROT_DBANK_CONTROL" width="32" offset="0x1090" description="Data Flash TRIM Hide Protection Control Register">
        <bitfield id="HDPROTACCDIS" description="Enable HDP access to TRIM region #br#0: HDP region access is enabled #br#1: HDP region access is disabled" begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_ENGR_HDPPROT_DBANK_CONTROL" width="32" offset="0x1094" description="Data Flash ENGR Hide Protection Control Register">
        <bitfield id="HDPROTACCDIS" description="Enable HDP access to ENGR region #br#0: HDP region access is enabled #br#1: HDP region access is disabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="HDPROTACCDIS1" description="No functionality implemented for this bit" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_ADC" width="32" offset="0x1100" description="Peripheral Secure Access ADC">
        <bitfield id="SEC_ADC0" description="Secure access enabled to ADC0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_ADC1" description="Secure access enabled to ADC1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_TIMER" width="32" offset="0x1108" description="Peripheral Secure Access Timer">
        <bitfield id="SEC_TIMA0_0" description="Secure access enabled to TIMA0_0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_TIMA0_1" description="Secure access enabled to TIMA0_1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_TIMG4_0" description="Secure access enabled to TIMG4_0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_TIMG4_1" description="Secure access enabled to TIMG4_1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_TIMG4_2" description="Secure access enabled to TIMG4_2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_TIMG4_3" description="Secure access enabled to TIMG4_3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_TIMG12_0" description="Secure access enabled to TIMG12_0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_TIMG8_0" description="Secure access enabled to TIMG8_0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_TIMG8_1" description="Secure access enabled to TIMG8_1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_UNICOMM" width="32" offset="0x1110" description="Peripheral Secure Access UniComm">
        <bitfield id="SEC_S0U1" description="Secure access enabled to UniComm S0U1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_S0U2" description="Secure access enabled to UniComm S0U2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_S1U0" description="Secure access enabled to UniComm S1U0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_S1U2" description="Secure access enabled to UniComm S1U2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_S1U3" description="Secure access enabled to UniComm S1U3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_S1U4" description="Secure access enabled to UniComm S1U4 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_S1U5" description="Secure access enabled to UniComm S1U5 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_S2U0" description="Secure access enabled to UniComm S2U0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_S2U1" description="Secure access enabled to UniComm S2U1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_S2U2" description="Secure access enabled to UniComm S2U2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_S2U3" description="Secure access enabled to UniComm S2U3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_GPIO" width="32" offset="0x1118" description="Peripheral Secure Access GPIO">
        <bitfield id="SEC_GPIOA" description="Secure access enabled to GPIO A #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_GPIOB" description="Secure access enabled to GPIO B #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_GPIOC" description="Secure access enabled to GPIO C #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_MCAN" width="32" offset="0x1120" description="Peripheral Secure Access CAN">
        <bitfield id="SEC_MCAN0" description="Secure access enabled to MCAN 0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_MCAN1" description="Secure access enabled to MCAN 1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_I2S" width="32" offset="0x1128" description="Peripheral Secure Access I2S">
        <bitfield id="SEC_I2S0" description="Secure access enabled to I2S 0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_I2S1" description="Secure access enabled to I2S 1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_ACOMP" width="32" offset="0x1130" description="Peripheral Secure Access Analog Comp">
        <bitfield id="SEC_ACOMP0" description="Secure access enabled to Comparator 0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_ACOMP1" description="Secure access enabled to Comparator 1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_WDT" width="32" offset="0x1138" description="Peripheral Secure Access Watchdog">
        <bitfield id="SEC_WWDT" description="Secure access enabled to Windowed Watchdog #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
