ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/GSC_0.1.xml
    <register id="GSC_PPC_SECATTRIB_LFSS" width="32" offset="0x1140" description="Peripheral Secure Access LFSS">
        <bitfield id="SEC_LFSS" description="Secure access enabled to LFSS (including peripherals inside LFSS e.g. IWDT) #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_CRC" width="32" offset="0x1148" description="Peripheral Secure Access CRC">
        <bitfield id="SEC_CRC" description="Secure access enabled to CRC #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_AES" width="32" offset="0x1150" description="Peripheral Secure Access AES">
        <bitfield id="SEC_AES" description="Secure access enabled to AES #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_SHA" width="32" offset="0x1158" description="Peripheral Secure Access SHA">
        <bitfield id="SEC_SHA" description="Secure access enabled to SHA #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_PKA" width="32" offset="0x1160" description="Peripheral Secure Access PKA">
        <bitfield id="SEC_PKA" description="Secure access enabled to PKA #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_IOMUX" width="32" offset="0x1168" description="Peripheral Secure Access IOMUX">
        <bitfield id="SEC_IOMUX" description="Secure access enabled to IOMUX #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_QSPI" width="32" offset="0x1170" description="Peripheral Secure Access QSPI">
        <bitfield id="SEC_QSPI" description="Secure access enabled to QSPI #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_TRNG" width="32" offset="0x1178" description="Peripheral Secure Access TRNG">
        <bitfield id="SEC_TRNG" description="Secure access enabled to TRNG #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_DEBUGSS" width="32" offset="0x1180" description="Peripheral Secure Access DEBUGSS">
        <bitfield id="SEC_DEBUGSS" description="Secure access enabled to DEBUGSS #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_VREF" width="32" offset="0x1188" description="Peripheral Secure Access VREF">
        <bitfield id="SEC_VREF" description="Secure access enabled to VREF #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_KEYSTORECTL" width="32" offset="0x1190" description="Peripheral Secure Access KEYSTORECTL">
        <bitfield id="SEC_KEYSTORECTL" description="Secure access enabled to KEYSTORECTL #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_EAM" width="32" offset="0x1198" description="Peripheral Secure Access EAM">
        <bitfield id="SEC_EAM" description="Secure access enabled to EAM #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_WUC" width="32" offset="0x11A0" description="Peripheral Secure Access WUC">
        <bitfield id="SEC_WUC" description="Secure access enabled to WUC #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_FRIREGS" width="32" offset="0x11A8" description="Peripheral Secure Access FRIREGS">
        <bitfield id="SEC_FRIREGS" description="Secure access enabled to FRIREGS #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_MEMCFG" width="32" offset="0x11B0" description="Peripheral Secure Access MEMCFG">
        <bitfield id="SEC_MEMCFG" description="Secure access enabled to MEMCFG #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_SYSCTL" width="32" offset="0x1208" description="Peripheral Secure Access System Control">
        <bitfield id="SEC_SYSCTL" description="Secure access enabled to SYSCTL #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_PRIVATTRIB_SYSCTL" width="32" offset="0x120C" description="Peripheral Privilege Access System Control">
        <bitfield id="PRIV_SYSCTL" description="Privilege access enabled to SYSCTL #br#0: Non-Privilege access is enabled #br#1: Privilege access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_DMA" width="32" offset="0x1210" description="Peripheral Secure Access DMA">
        <bitfield id="SEC_DMA0" description="Secure access enabled to DMA0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEC_DMA1" description="Secure access enabled to DMA1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_PRIVATTRIB_DMA" width="32" offset="0x1214" description="Peripheral Privilege Access DMA">
        <bitfield id="PRIV_DMA0" description="Privilege access enabled to DMA0 #br#0: Non-Privilege access is enabled #br#1: Privilege access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRIV_DMA1" description="Privilege access enabled to DMA1 #br#0: Non-Privilege access is enabled #br#1: Privilege access is enabled" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SECATTRIB_GSC" width="32" offset="0x1218" description="Peripheral Secure Access GSC">
        <bitfield id="SEC_GSC" description="Secure access enabled to GSC #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
