ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/GSC_0.1.xml
    <register id="GSC_PPC_PRIVATTRIB_GSC" width="32" offset="0x121C" description="Peripheral Privilege Access GSC">
        <bitfield id="PRIV_GSC" description="Privilege access enabled to GSC #br#0: Non-Privilege access is enabled #br#1: Privilege access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SPARERW_GSC" width="32" offset="0x1220" description="Peripheral Spare RW Register">
        <bitfield id="ZERO_PKASRAM" description="Controls the zeroization of PKA SRAM #br#0: PKA SRAM zeroization is enabled #br#1: PKA SRAM zeroization is disabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_PPC_SPARERW1S_GSC" width="32" offset="0x1224" description="Peripheral Spare RW1S Register">
    </register>
    <register id="GSC_SPC_SECATTRIB0" width="32" offset="0x1280" description="SRAM Secure Attribute-0 Register">
        <bitfield id="C0B0_512B" description="Secure access enabled to 1st 512 byte in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B1_512B" description="Secure access enabled to 2nd 512 byte in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B0_1KB" description="Secure access enabled to 1KB in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B0_2KB" description="Secure access enabled to 2KB in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B0_4KB" description="Secure access enabled to 1st 4KB in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B1_4KB" description="Secure access enabled to 2nd 4KB in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B2_4KB" description="Secure access enabled to 3rd 4KB in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B0_512B" description="Secure access enabled to 1st 512 byte in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B1_512B" description="Secure access enabled to 2nd 512 byte in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B0_1KB" description="Secure access enabled to 1KB in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B0_2KB" description="Secure access enabled to 2KB in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B0_4KB" description="Secure access enabled to 1st 4KB in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B1_4KB" description="Secure access enabled to 2nd 4KB in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B2_4KB" description="Secure access enabled to 3rd 4KB in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B0_512B" description="Secure access enabled to 1st 512 byte in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B1_512B" description="Secure access enabled to 2nd 512 byte in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B0_1KB" description="Secure access enabled to 1KB in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="18" end="18" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B0_2KB" description="Secure access enabled to 2KB in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B0_4KB" description="Secure access enabled to 1st 4KB in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B1_4KB" description="Secure access enabled to 2nd 4KB in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="21" end="21" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B2_4KB" description="Secure access enabled to 3rd 4KB in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B0_512B" description="Secure access enabled to 1st 512 byte in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B1_512B" description="Secure access enabled to 2nd 512 byte in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B0_1KB" description="Secure access enabled to 1KB in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="26" end="26" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B0_2KB" description="Secure access enabled to 2KB in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="27" end="27" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B0_4KB" description="Secure access enabled to 1st 4KB in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="28" end="28" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B1_4KB" description="Secure access enabled to 2nd 4KB in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="29" end="29" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B2_4KB" description="Secure access enabled to 3rd 4KB in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_SPC_SECATTRIB1" width="32" offset="0x1284" description="SRAM Secure Attribute-1 Register">
        <bitfield id="C0B0_512B" description="Secure access enabled to 1st 512 byte in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B1_512B" description="Secure access enabled to 2nd 512 byte in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B0_1KB" description="Secure access enabled to 1KB in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B0_2KB" description="Secure access enabled to 2KB in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B0_4KB" description="Secure access enabled to 1st 4KB in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B1_4KB" description="Secure access enabled to 2nd 4KB in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B2_4KB" description="Secure access enabled to 3rd 4KB in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B0_512B" description="Secure access enabled to 1st 512 byte in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B1_512B" description="Secure access enabled to 2nd 512 byte in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B0_1KB" description="Secure access enabled to 1KB in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B0_2KB" description="Secure access enabled to 2KB in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B0_4KB" description="Secure access enabled to 1st 4KB in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B1_4KB" description="Secure access enabled to 2nd 4KB in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B2_4KB" description="Secure access enabled to 3rd 4KB in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B0_512B" description="Secure access enabled to 1st 512 byte in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B1_512B" description="Secure access enabled to 2nd 512 byte in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B0_1KB" description="Secure access enabled to 1KB in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="18" end="18" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B0_2KB" description="Secure access enabled to 2KB in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B0_4KB" description="Secure access enabled to 1st 4KB in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B1_4KB" description="Secure access enabled to 2nd 4KB in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="21" end="21" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B2_4KB" description="Secure access enabled to 3rd 4KB in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B0_512B" description="Secure access enabled to 1st 512 byte in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B1_512B" description="Secure access enabled to 2nd 512 byte in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B0_1KB" description="Secure access enabled to 1KB in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="26" end="26" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B0_2KB" description="Secure access enabled to 2KB in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="27" end="27" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B0_4KB" description="Secure access enabled to 1st 4KB in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="28" end="28" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B1_4KB" description="Secure access enabled to 2nd 4KB in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="29" end="29" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B2_4KB" description="Secure access enabled to 3rd 4KB in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_SPC_SECATTRIB2" width="32" offset="0x1288" description="SRAM Secure Attribute-2 Register">
        <bitfield id="C0B0_512B" description="Secure access enabled to 1st 512 byte in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B1_512B" description="Secure access enabled to 2nd 512 byte in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B0_1KB" description="Secure access enabled to 1KB in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B0_2KB" description="Secure access enabled to 2KB in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B0_4KB" description="Secure access enabled to 1st 4KB in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B1_4KB" description="Secure access enabled to 2nd 4KB in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B2_4KB" description="Secure access enabled to 3rd 4KB in chunk-0 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B0_512B" description="Secure access enabled to 1st 512 byte in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B1_512B" description="Secure access enabled to 2nd 512 byte in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B0_1KB" description="Secure access enabled to 1KB in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B0_2KB" description="Secure access enabled to 2KB in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B0_4KB" description="Secure access enabled to 1st 4KB in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B1_4KB" description="Secure access enabled to 2nd 4KB in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B2_4KB" description="Secure access enabled to 3rd 4KB in chunk-1 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B0_512B" description="Secure access enabled to 1st 512 byte in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B1_512B" description="Secure access enabled to 2nd 512 byte in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B0_1KB" description="Secure access enabled to 1KB in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="18" end="18" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B0_2KB" description="Secure access enabled to 2KB in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B0_4KB" description="Secure access enabled to 1st 4KB in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B1_4KB" description="Secure access enabled to 2nd 4KB in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="21" end="21" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B2_4KB" description="Secure access enabled to 3rd 4KB in chunk-2 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B0_512B" description="Secure access enabled to 1st 512 byte in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B1_512B" description="Secure access enabled to 2nd 512 byte in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B0_1KB" description="Secure access enabled to 1KB in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="26" end="26" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B0_2KB" description="Secure access enabled to 2KB in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="27" end="27" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B0_4KB" description="Secure access enabled to 1st 4KB in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="28" end="28" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B1_4KB" description="Secure access enabled to 2nd 4KB in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="29" end="29" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B2_4KB" description="Secure access enabled to 3rd 4KB in chunk-3 #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
    </register>
