ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/GSC_0.1.xml
    <register id="GSC_SPC_PRIVATTRIB3" width="32" offset="0x12CC" description="SRAM Privilege Attribute-3 Register">
        <bitfield id="C0B0_512B" description="privilege access enabled to 1st 512 byte in chunk-0 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B1_512B" description="privilege access enabled to 2nd 512 byte in chunk-0 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B0_1KB" description="privilege access enabled to 1KB in chunk-0 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B0_2KB" description="privilege access enabled to 2KB in chunk-0 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B0_4KB" description="privilege access enabled to 1st 4KB in chunk-0 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B1_4KB" description="privilege access enabled to 2nd 4KB in chunk-0 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C0B2_4KB" description="privilege access enabled to 3rd 4KB in chunk-0 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B0_512B" description="privilege access enabled to 1st 512 byte in chunk-1 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B1_512B" description="privilege access enabled to 2nd 512 byte in chunk-1 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B0_1KB" description="privilege access enabled to 1KB in chunk-1 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B0_2KB" description="privilege access enabled to 2KB in chunk-1 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B0_4KB" description="privilege access enabled to 1st 4KB in chunk-1 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B1_4KB" description="privilege access enabled to 2nd 4KB in chunk-1 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C1B2_4KB" description="privilege access enabled to 3rd 4KB in chunk-1 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B0_512B" description="privilege access enabled to 1st 512 byte in chunk-2 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B1_512B" description="privilege access enabled to 2nd 512 byte in chunk-2 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B0_1KB" description="privilege access enabled to 1KB in chunk-2 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="18" end="18" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B0_2KB" description="privilege access enabled to 2KB in chunk-2 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B0_4KB" description="privilege access enabled to 1st 4KB in chunk-2 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B1_4KB" description="privilege access enabled to 2nd 4KB in chunk-2 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="21" end="21" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C2B2_4KB" description="privilege access enabled to 3rd 4KB in chunk-2 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B0_512B" description="privilege access enabled to 1st 512 byte in chunk-3 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B1_512B" description="privilege access enabled to 2nd 512 byte in chunk-3 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B0_1KB" description="privilege access enabled to 1KB in chunk-3 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="26" end="26" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B0_2KB" description="privilege access enabled to 2KB in chunk-3 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="27" end="27" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B0_4KB" description="privilege access enabled to 1st 4KB in chunk-3 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="28" end="28" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B1_4KB" description="privilege access enabled to 2nd 4KB in chunk-3 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="29" end="29" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="C3B2_4KB" description="privilege access enabled to 3rd 4KB in chunk-3 #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_SECATTRIBA0" width="32" offset="0x1300" description="Flash Secure Attribute Register A0">
    </register>
    <register id="GSC_FPC_SECATTRIBA1" width="32" offset="0x1304" description="Flash Secure Attribute Register A1">
    </register>
    <register id="GSC_FPC_SECATTRIBB0" width="32" offset="0x1308" description="Flash Secure Attribute Register B0">
        <bitfield id="SEC_PAGE" description="Secure access enable for 64KB-512KB flash with each bit representing 8 sectors of 2KB #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="31" end="4" width="28" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_SECATTRIBB1" width="32" offset="0x130C" description="Flash Secure Attribute Register B1">
        <bitfield id="SEC_PAGE" description="Secure access enable for 64KB-512KB flash with each bit representing 8 sectors of 2KB #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="31" end="4" width="28" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_NONMAIN_SECATTRIB0" width="32" offset="0x1310" description="Flash Non-Main Secure Attribute Register 0">
        <bitfield id="SEC_PAGE" description="Secure access enable for first 4 sectors of flash with each bit representing 1 sector of 2KB #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_NONMAIN_SECATTRIB1" width="32" offset="0x1314" description="Flash Non-Main Secure Attribute Register 1">
        <bitfield id="SEC_PAGE" description="Secure access enable for first 4 sectors of flash with each bit representing 1 sector of 2KB #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_TRIM_SECATTRIB0" width="32" offset="0x1318" description="Flash Trim Secure Attribute Register 0">
        <bitfield id="SEC_PAGE" description="Secure access enable for the flash with each bit representing 1 sector of 2KB #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_TRIM_SECATTRIB1" width="32" offset="0x131C" description="Flash Trim Secure Attribute Register 1">
        <bitfield id="SEC_PAGE" description="Secure access enable for the flash with each bit representing 1 sector of 2KB #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
