ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/GSC_0.1.xml
    <register id="GSC_FPC_ENGR_SECATTRIB0" width="32" offset="0x1320" description="Flash Engr Secure Attribute Register 0">
        <bitfield id="SEC_PAGE" description="Secure access enable for the flash with each bit representing 1 sector of 2KB #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_ENGR_SECATTRIB1" width="32" offset="0x1324" description="Flash Engr Secure Attribute Register 1">
        <bitfield id="SEC_PAGE" description="Secure access enable for the flash with each bit representing 1 sector of 2KB #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_SECATTRIBA_DFLASH" width="32" offset="0x1380" description="Data Flash Secure Attribute Register A">
        <bitfield id="SEC_PAGE_DFLASH" description="Secure access enable for first 16 sectors data flash page with each bit representing 1 sector of 2KB #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_ENGR_SECATTRIB_DFLASH" width="32" offset="0x1384" description="Data Flash ENGR Secure Attribute Register">
        <bitfield id="SEC_PAGE_DFLASH" description="Secure access enable for 1 sector of 2KB  #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_NONMAIN_SECATTRIB_DFLASH" width="32" offset="0x1388" description="Data Flash Non-Main Secure Attribute Register">
        <bitfield id="SEC_PAGE_DFLASH" description="Secure access enable for 4 sector  with each bit representing 1 sector of 2KB #br#0: Non-secure access is enabled #br#1: Secure access is enabled" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_PRIVATTRIBA0" width="32" offset="0x1400" description="Flash Privilege Attribute Register A0">
    </register>
    <register id="GSC_FPC_PRIVATTRIBA1" width="32" offset="0x1404" description="Flash Privilege Attribute Register A1">
    </register>
    <register id="GSC_FPC_PRIVATTRIBB0" width="32" offset="0x1408" description="Flash Privilege Attribute Register B0">
        <bitfield id="PRIV_PAGE" description="Privilege access enable for 64KB-512KB flash with each bit representing 8 sectors of 2KB #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="31" end="4" width="28" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_PRIVATTRIBB1" width="32" offset="0x140C" description="Flash Privilege Attribute Register B1">
        <bitfield id="PRIV_PAGE" description="Privilege access enable for 64KB-512KB flash with each bit representing 8 sectors of 2KB #br#0: Non-privilege access is enabled #br#1: privilege access is enabled" begin="31" end="4" width="28" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_NONMAIN_PRIVATTRIB0" width="32" offset="0x1410" description="Flash Non-Main Privilege Attribute Register B0">
        <bitfield id="PRIV_PAGE" description="Privilege access enable for first 4 sectors of flash with each bit representing 1 sector of 2KB #br#0: Non-Privilege access is enabled #br#1: Privilege access is enabled" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_NONMAIN_PRIVATTRIB1" width="32" offset="0x1414" description="Flash Non-Main Privilege Attribute Register B1">
        <bitfield id="PRIV_PAGE" description="Privilege access enable for first 4 sectors of flash with each bit representing 1 sector of 2KB #br#0: Non-Privilege access is enabled #br#1: Privilege access is enabled" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_TRIM_PRIVATTRIB0" width="32" offset="0x1418" description="Flash Trim Privilege Attribute Register B0">
        <bitfield id="PRIV_PAGE" description="Privilege access enable for the flash with each bit representing 1 sector of 2KB #br#0: Non-Privilege access is enabled #br#1: Privilege access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_TRIM_PRIVATTRIB1" width="32" offset="0x141C" description="Flash Trim Privilege Attribute Register B1">
        <bitfield id="PRIV_PAGE" description="Privilege access enable for the flash with each bit representing 1 sector of 2KB #br#0: Non-Privilege access is enabled #br#1: Privilege access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_ENGR_PRIVATTRIB0" width="32" offset="0x1420" description="Flash Engr Privilege Attribute Register B0">
        <bitfield id="PRIV_PAGE" description="Privilege access enable for the flash with each bit representing 1 sector of 2KB #br#0: Non-Privilege access is enabled #br#1: Privilege access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_ENGR_PRIVATTRIB1" width="32" offset="0x1424" description="Flash Engr Privilege Attribute Register B1">
        <bitfield id="PRIV_PAGE" description="Privilege access enable for the flash with each bit representing 1 sector of 2KB #br#0: Non-Privilege access is enabled #br#1: Privilege access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_PRIVATTRIBA_DFLASH" width="32" offset="0x1480" description="Data Flash Privilege Attribute Register">
        <bitfield id="PRIV_PAGE_DFLASH" description="Privilege access enable for first 16 sectors data flash page with each bit representing 1 sector of 2KB #br#0: Non-Privilege access is enabled #br#1: Privilege access is enabled" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
