ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/GSC_0.1.xml
    <register id="GSC_FPC_NONMAIN_PRIVATTRIB_DFLASH" width="32" offset="0x1484" description="Data Flash NONMAIN Privilege Attribute Register">
        <bitfield id="PRIV_PAGE_DFLASH" description="Privilege access enable for 4 sectors each of 2KB #br#0: Non-Privilege access is enabled #br#1: Privilege access is enabled" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_ENGR_PRIVATTRIB_DFLASH" width="32" offset="0x1488" description="Data Flash ENGR Privilege Attribute Register">
        <bitfield id="PRIV_PAGE_DFLASH" description="Privilege access enable for 1 sector of 2KB #br#0: Non-Privilege access is enabled #br#1: Privilege access is enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_WEPROTA0" width="32" offset="0x1600" description="Flash Write Protect Attribute Register A0">
    </register>
    <register id="GSC_FPC_WEPROTA1" width="32" offset="0x1604" description="Flash Write Protect Attribute Register A1">
    </register>
    <register id="GSC_FPC_WEPROTB0" width="32" offset="0x1608" description="Flash Write Protect Attribute Register B0">
    </register>
    <register id="GSC_FPC_WEPROTB1" width="32" offset="0x160C" description="Flash Write Protect Attribute Register B1">
    </register>
    <register id="GSC_FPC_WEPROTNONMAIN0" width="32" offset="0x1610" description="Flash Non-Main Write Protect Attribute Register B0">
        <bitfield id="WEPROT_PAGE" description="Write protection enable for first 4 sectors of flash with each bit representing 1 sector of 2KB #br#0: Page is not erase/program protected #br#1: Page is erase/program protected" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_WEPROTNONMAIN1" width="32" offset="0x1614" description="Flash Non-Main Write Protect Attribute Register B1">
        <bitfield id="WEPROT_PAGE" description="Write protection enable for first 4 sectors of flash with each bit representing 1 sector of 2KB #br#0: Page is not erase/program protected #br#1: Page is erase/program protected" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_WEPROTTRIM0" width="32" offset="0x1618" description="Flash Trim Write Protect Attribute Register B0">
        <bitfield id="WEPROT_PAGE" description="Write protection enable for first 2 sectors of flash with each bit representing 1 sector of 2KB #br#0: Page is not erase/program protected #br#1: Page is erase/program protected" begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_WEPROTTRIM1" width="32" offset="0x161C" description="Flash Trim Write Protect Attribute Register B1">
        <bitfield id="WEPROT_PAGE" description="Write protection enable for first 2 sectors of flash with each bit representing 1 sector of 2KB #br#0: Page is not erase/program protected #br#1: Page is erase/program protected" begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_WEPROTENGR0" width="32" offset="0x1620" description="Flash Engr Write Protect Attribute Register B0">
        <bitfield id="WEPROT_PAGE" description="Write protection enable for first 2 sectors of flash with each bit representing 1 sector of 2KB #br#0: Page is not erase/program protected #br#1: Page is erase/program protected" begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_WEPROTENGR1" width="32" offset="0x1624" description="Flash Engr Write Protect Attribute Register B1">
        <bitfield id="WEPROT_PAGE" description="Write protection enable for first 2 sectors of flash with each bit representing 1 sector of 2KB #br#0: Page is not erase/program protected #br#1: Page is erase/program protected" begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_WEPROTA_DFLASH" width="32" offset="0x1700" description="Data Flash Write Protect Attribute Register A">
        <bitfield id="WEPROT_PAGE_DFLASH" description="Write protection enable for first 16 sectors data flash page with each bit representing 1 sector of 2KB #br#0: Page is not erase/program protected #br#1: Page is erase/program protected" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
        <bitfield id="WEPROT_PAGE_DFLASH_RSVD" description="No functionality implemented for these bits" begin="31" end="16" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_WEPROT_NONMAIN_DFLASH" width="32" offset="0x1704" description="DATA Flash Non- Main Write Protect Attribute Register">
        <bitfield id="WEPROT_PAGE_DFLASH" description="Write protection enable for NONMAIN sectors data flash page with each bit representing 1 sector of 2KB #br#0: Page is not erase/program protected #br#1: Page is erase/program protected" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_WEPROT_ENGR_DFLASH" width="32" offset="0x1708" description="DATA Flash ENGR Write Protect Attribute Register">
        <bitfield id="WEPROT_PAGE_DFLASH" description="Write protection enable for ENGR data flash page with each bit representing 1 sector of 2KB #br#0: Page is not erase/program protected #br#1: Page is erase/program protected" begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_FLSEMREQ" width="32" offset="0x1800" description="Flash semaphore request register">
        <bitfield id="REQ" description="If the FLSEMSTAT.ASSIGNED bit is cleared, writing a '1' to this bit  causes: #br#  1) Load the SECURE attribute  of the code performing the write into the FLSEMSTAT.SEC bit field, and #br#  2) Load the Privilage attribute of the code performing the write into the FLSEMSTAT.PRIV bit field, and #br# 3) Set the FLSEMSTAT.ASSIGNED bit. #br#If the FLSEMSTAT.ASSIGNED is already set when a write to this bit occurs, the write will be ignored.  #br# #br#If the above conditions are not met during the write, the write will be ignored with no error indicator. It is advised that the writing code perform a read of the FLSEMSTAT register  to ensure it was set after writing to this bit." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_FLSEMCLR" width="32" offset="0x1804" description="Flash semaphore release register">
        <bitfield id="CLR" description="If the following conditions are met, a write of '1' to this bit causes the FLSEMSTAT register to its reset state: #br#  1) The FLSEMSTAT.SEC  of the code performing the write is 0x1 and FLSEMSTAT.PRIV of the code performing the write is 0x1 (i.e. secure privilage code can force relinquishing of the semaphore) or #br#  2) FLSEMSTAT.ASSIGNED bit is set, and #br#      a) FLSEMSTAT.SEC  matches security attribute of the code performing the write, and #br#      b) FLSEMSTAT.PRIV  matches privilege attribute code performing the write. #br# #br#If the above conditions are not met during the write, the write will be ignored with no error indicated. It is advised that the writing code perform a read of the FLSEMSTAT register  to ensure it was cleared after writing to this bit." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_FPC_FLSEMSTAT" width="32" offset="0x1808" description="Flash semaphore statys registers">
        <bitfield id="SEC" description="Defines the flash controller semaphore owners security attribute #br#  0x0 : non-secure #br#  0x1 :secure" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PRIV" description="Defines the flash controller semaphore owners privilage attribute #br#  0x0 : non-privilage #br#  0x1 :prvilage" begin="8" end="8" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="DBGACC" description="Defines the flash controller semaphore owners debug access indication #br#  0x0 : functional access #br#  0x1 :Debug access" begin="16" end="16" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="MATCH" description="On a read, this bit will reflect whether the reader's SEC and PRIV matches the ownership of the flash controller. #br#  0 : Code performing read does not own the flash controller semaphore #br#  1 : Code performing read owns the flash controller semphore. #br#This avoids code from being required to know whether the current code segment owns the flash  controller configuration." begin="30" end="30" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="ASSIGNED" description="SEC  and PRIV fields are valid when this bit is set. #br#  0 : SEC  and PRIV are unassigned and flash controller is not accessible #br#  1 : SEC and PRIV values are valid and the flash controller is currently assigned to them" begin="31" end="31" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="GSC_DMA_TRIG_SEL" width="32" offset="0x1A80" description="DMA Trigger Selection register">
        <bitfield id="SEL_TRIG" description="Select signal for DMA triggers to be routed to DMA0/DMA1 #br#0: DMA0 will be selected #br#1: DMA1 will be selected #br#Note: SEL_TRIG[9:6] is not used. #br#If a specific DMA is selected, the triggers should only go to that DMA" begin="27" end="0" width="28" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_DMA_FIX_TRIG_SEL" width="32" offset="0x1A84" description="DMA Fixed Trigger Selection register">
        <bitfield id="SEL_TRIG" description="Select signal for Fixed DMA triggers to be routed to DMA0/DMA1 #br#0: DMA0 will be selected #br#1: DMA1 will be selected #br# #br#If a specific DMA is selected, the triggers should only go to that DMA" begin="10" end="0" width="11" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_VTOR_S" width="32" offset="0x1B80" description="Secure Vector Table Offset Register">
    </register>
    <register id="GSC_VTOR_NS" width="32" offset="0x1B84" description="Non - Secure Vector Table Offset Register">
    </register>
    <register id="GSC_DTB_MUXSEL" width="32" offset="0x1C80" description="Digital Test Bus MUX Selection">
        <bitfield id="DTB_MUX_SEL_CPU" description="DTB Mux Sel for CPU signals to be brought out on DTB. Refer to implementaion spec for mux selection table." begin="2" end="0" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="DTB_MUX_SEL_WUC" description="DTB Mux Sel for WUC signals to be brought out on DTB. Refer to implementaion spec for mux selection table." begin="9" end="5" width="5" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_DICE_CHECKSUM0" width="32" offset="0x1D00" description="DICE checksum data register-0">
    </register>
    <register id="GSC_DICE_CHECKSUM1" width="32" offset="0x1D04" description="DICE checksum data register-1">
    </register>
