ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/GSC_0.1.xml
    <register id="GSC_DICE_CHECKSUM2" width="32" offset="0x1D08" description="DICE checksum data register-2">
    </register>
    <register id="GSC_DICE_CHECKSUM3" width="32" offset="0x1D0C" description="DICE checksum data register-3">
    </register>
    <register id="GSC_DICE_CHECKSUM4" width="32" offset="0x1D10" description="DICE checksum data register-4">
    </register>
    <register id="GSC_DICE_CHECKSUM5" width="32" offset="0x1D14" description="DICE checksum data register-5">
    </register>
    <register id="GSC_DICE_CHECKSUM6" width="32" offset="0x1D18" description="DICE checksum data register-6">
    </register>
    <register id="GSC_DICE_CHECKSUM7" width="32" offset="0x1D1C" description="DICE checksum data register-7">
    </register>
    <register id="GSC_GSC_LOCK" width="32" offset="0x1D80" description="GSC Lock configuration register">
        <bitfield id="ATTRIBVIOL_CONFIG" description="Configuration impacts registers SPC_ATTRIBVIOLS_CONFIG, SPC_ATTRIBVIOLP_CONFIG, PPC_ATTRIBVIOLS_CONFIG, PPC_ATTRIBVIOLP_CONFIG, FPC_ATTRIBVIOLS_CONFIG, FPC_ATTRIBVIOLP_CONFIG	 #br#0: Register configuration is not locked. #br#1: Register configuration is locked. #br# #br#Once register is locked - reads give the MMR data and writes are ignored" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPC_AATRIB" description="Configuration impacts registers PPC_SECATTRIB_* and PPC_PRIVATTRIB_* #br#0: Register configuration is not locked. #br#1: Register configuration is locked. #br# #br#Once register is locked - reads give the MMR data and writes are ignored" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SPC_AATRIB" description="Configuration impacts registers SPC_SECATTRIB_* and SPC_PRIVATTRIB_* #br#0: Register configuration is not locked. #br#1: Register configuration is locked. #br# #br#Once register is locked - reads give the MMR data and writes are ignored" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="FPPC_AATRIB" description="Configuration impacts registers FPC_SECATTRIB_* and FPC_PRIVATTRIB_* #br#0: Register configuration is not locked. #br#1: Register configuration is locked. #br# #br#Once register is locked - reads give the MMR data and writes are ignored" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="VTOR" description="Configuration impacts registers VTOR_* #br#0: Register configuration is not locked. #br#1: Register configuration is locked. #br# #br#Once register is locked - reads give the MMR data and writes are ignored" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMA_TRIG_SEL" description="Configuration impacts registers DMA_TRIG_SEL* #br#0: Register configuration is not locked. #br#1: Register configuration is locked. #br# #br#Once register is locked - reads give the MMR data and writes are ignored" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DTB_MUXSEL" description="Configuration impacts registers DTB_MUX_SEL #br#0: Register configuration is not locked. #br#1: Register configuration is locked. #br# #br#Once register is locked - reads give the MMR data and writes are ignored" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_GSC_COMMIT" width="32" offset="0x1D84" description="GSC commit configuration register">
        <bitfield id="ATTRIBVIOL_CONFIG" description="0: Register lock configuration is not committed. #br#1: Register configuration is committed. #br#Commit configuration blocks the writes going to the lock register. Once configuration is committed, only reset can change the configuration." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPC_AATRIB" description="0: Register lock configuration is not committed. #br#1: Register configuration is committed. #br#Commit configuration blocks the writes going to the lock register. Once configuration is committed, only reset can change the configuration." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SPC_AATRIB" description="0: Register lock configuration is not committed. #br#1: Register configuration is committed. #br#Commit configuration blocks the writes going to the lock register. Once configuration is committed, only reset can change the configuration." begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="FPPC_AATRIB" description="0: Register lock configuration is not committed. #br#1: Register configuration is committed. #br#Commit configuration blocks the writes going to the lock register. Once configuration is committed, only reset can change the configuration." begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="VTOR" description="0: Register lock configuration is not committed. #br#1: Register configuration is committed. #br#Commit configuration blocks the writes going to the lock register. Once configuration is committed, only reset can change the configuration." begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DMA_TRIG_SEL" description="0: Register lock configuration is not committed. #br#1: Register configuration is committed. #br#Commit configuration blocks the writes going to the lock register. Once configuration is committed, only reset can change the configuration." begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DTB_MUXSEL" description="0: Register lock configuration is not committed. #br#1: Register configuration is committed. #br#Once configuration is committed, only reset can change the configuration." begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="GSC_GSC_REVISION" width="32" offset="0x1FFC" description="GSC Revision register">
        <bitfield id="MINREV" description="This hardcoded field defines the minor revision of the IP." begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="MAJREV" description="This hardcoded field defines the major revision of the IP." begin="15" end="8" width="8" rwaccess="R">
        </bitfield>
    </register>

</module>